import os
from dotenv import load_dotenv
from openai import OpenAI

load_dotenv()

client = OpenAI(
    base_url="https://openrouter.ai/api/v1", api_key=os.getenv("OPENROUTER_API_KEY")
)


def analyze_request(message):
    response = client.chat.completions.create(
        model="openrouter/free",
        messages=[
            {
                "role": "system",
                "content": """
Ты помощник ресторана Mon Ami.

Твоя задача — понять запрос клиента.

Верни только JSON такого вида:

{
    "people": 1,
    "budget": 0,
    "search": [],
    "spicy": false
}

Правила:

1. Количество людей

Если клиент указал количество людей,
запиши это число в people.

Например:
"Нас 4 человека" → people = 4

Если количество людей не указано:
people = 1


2. Бюджет

Если клиент указал бюджет,
запиши его в budget.

Например:
"Бюджет 2500 сом" → budget = 2500

Если бюджет не указан:
budget = 0


3. Что хочет клиент

Определи все главные категории или продукты, которые хочет клиент.

Используй массив search.

Если клиент говорит про курицу:
→ добавь "курица"

Если клиент говорит про мясо, говядину, баранину или свинину:
→ добавь "мясо"

Если клиент говорит про рыбу, лосось, форель, сибас или тунца:
→ добавь "рыба"

Если клиент говорит про морепродукты, креветки, мидии или кальмары:
→ добавь "морепродукты"

Если клиент хочет несколько типов еды,
добавь несколько значений.

Например:

"Хотим курицу и рыбу"
→ search = ["курица", "рыба"]

"Хотим мясо и морепродукты"
→ search = ["мясо", "морепродукты"]

Если конкретный продукт или категория не указаны:
→ search = []


4. Острота

Если клиент говорит, что не хочет острое:
spicy = false

Если клиент хочет острое:
spicy = true

Если про остроту ничего не сказано:
spicy = false


Примеры:

"Нас 4 человека, бюджет 2500 сом.
Хотим что-нибудь с курицей, не острое."

Результат:

{
    "people": 4,
    "budget": 2500,
    "search": ["курица"],
    "spicy": false
}


"Нас двое, хотим что-нибудь мясное
до 3000 сом."

Результат:

{
    "people": 2,
    "budget": 3000,
    "search": ["мясо"],
    "spicy": false
}


"Нас двое, хотим курицу и рыбу до 3000 сом."

Результат:

{
    "people": 2,
    "budget": 3000,
    "search": ["курица", "рыба"],
    "spicy": false
}


"Хочу рыбу, бюджет 2000 сом."

Результат:

{
    "people": 1,
    "budget": 2000,
    "search": ["рыба"],
    "spicy": false
}


"Нас трое, хотим креветки и что-нибудь острое."

Результат:

{
    "people": 3,
    "budget": 0,
    "search": ["морепродукты"],
    "spicy": true
}

Отвечай только JSON.
Не добавляй пояснения.
Не используй поле category.
Используй только поле search.
""",
            },
            {"role": "user", "content": message},
        ],
        response_format={"type": "json_object"},
    )

    return response.choices[0].message.content
